maoravni/Dev/FEC/Common/3rdParty/umonm/umon_main/target/soc/kinetis/hal/can/fsl_flexcan_hal.c
    /* Check for low power mode*/
    if (BR_CAN_MCR_LPMACK(instance))
    {
        /* Enable clock*/
        HW_CAN_MCR_CLR(instance, BM_CAN_MCR_MDIS);
        /* Wait until enabled*/
        while (BR_CAN_MCR_LPMACK(instance)){}
    }

    /* Reset the FLEXCAN*/
    HW_CAN_MCR_SET(instance, BM_CAN_MCR_SOFTRST);

    /* Wait for reset cycle to complete*/
    while (BR_CAN_MCR_SOFTRST(instance)){}

    /* Set Freeze, Halt*/
    HW_CAN_MCR_SET(instance, (BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT));

    /* check for freeze Ack*/
    while ((!BR_CAN_MCR_FRZACK(instance)) ||
       (!BR_CAN_MCR_NOTRDY(instance))){}

    return (kStatus_FLEXCAN_Success);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_select_clk
 * Description   : Select FlexCAN clock source.
 * This function will select either internal bus clock or external clock as
 * FlexCAN clock source.
 *
 *END**************************************************************************/
flexcan_status_t flexcan_hal_select_clk(
    uint8_t instance,
    flexcan_clk_source_t clk)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);

    if (clk == kFlexCanClkSource_Ipbus)
    {
       /* Internal bus clock (fsys/2)*/
        HW_CAN_CTRL1_SET(instance, BM_CAN_CTRL1_CLKSRC);
    }
    else if (clk == kFlexCanClkSource_Osc)
    {
        /* External clock*/
        HW_CAN_CTRL1_CLR(instance, BM_CAN_CTRL1_CLKSRC);
    }
    else
    {
       return (kStatus_FLEXCAN_InvalidArgument);
    }

    return (kStatus_FLEXCAN_Success);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_init
 * Description   : Initialize FlexCAN module.
 * This function will reset FlexCAN module, set maximum number of message
 * buffers, initialize all message buffers as inactive, enable RX FIFO
 * if needed, mask all mask bits, and disable all MB interrupts. 
 *
 *END**************************************************************************/
flexcan_status_t flexcan_hal_init(uint8_t instance, const flexcan_user_config_t *data)
{
    uint32_t i;
    assert(instance < HW_CAN_INSTANCE_COUNT);
    assert(data);

    volatile CAN_Type  *flexcan_reg_ptr;
    flexcan_reg_ptr = ((CAN_Type *)REGS_CAN_BASE(instance));
    if (NULL == flexcan_reg_ptr)
    {
        return (kStatus_FLEXCAN_InvalidArgument);
    }

    /* Reset FLEXCAN, Halt, freeze mode*/
    if(flexcan_hal_sw_reset(instance))
    {
        return (kStatus_FLEXCAN_Fail);
    }

    /* Wait for entering the freeze mode*/
    while(!(BR_CAN_MCR_FRZACK(instance))) {}

    /* Set maximum number of message buffers*/
    BW_CAN_MCR_MAXMB(instance, data->max_num_mb);
    
    /* Initialize all message buffers as inactive*/
    for (i = 0; i < data->max_num_mb; i++)
    {
        flexcan_reg_ptr->MB[i].CS = 0x0;
        flexcan_reg_ptr->MB[i].ID = 0x0;
        flexcan_reg_ptr->MB[i].WORD0 = 0x0;
        flexcan_reg_ptr->MB[i].WORD1 = 0x0;
    }

    /* Enable RX FIFO if need*/
    if (data->is_rx_fifo_needed)
    {
        /* Enable RX FIFO*/
        HW_CAN_MCR_SET(instance, BM_CAN_MCR_RFEN);
        /* Set the number of the RX FIFO filters needed*/
        BW_CAN_CTRL2_RFFN(instance, data->num_id_filters);
        /* RX FIFO global mask*/
        HW_CAN_RXFGMASK_WR(instance, CAN_ID_EXT(CAN_RXFGMASK_FGM_MASK));
        for (i = 0; i < data->max_num_mb; i++)
        {
            /* RX individual mask*/
            HW_CAN_RXIMRn_WR(instance, i, CAN_ID_EXT(CAN_RXIMR_MI_MASK));
        }
    }

    /* Rx global mask*/
    HW_CAN_RXMGMASK_WR(instance, CAN_ID_EXT(CAN_RXMGMASK_MG_MASK));

    /* Rx reg 14 mask*/
    HW_CAN_RX14MASK_WR(instance, CAN_ID_EXT(CAN_RX14MASK_RX14M_MASK));

    /* Rx reg 15 mask*/
    HW_CAN_RX15MASK_WR(instance, CAN_ID_EXT(CAN_RX15MASK_RX15M_MASK));

    /* De-assert Freeze Mode*/
    HW_CAN_MCR_CLR(instance, BM_CAN_MCR_FRZ);

    /* Wait till exit of freeze mode*/
    while(BR_CAN_MCR_FRZACK(instance)){}

    /* Disable all MB interrupts*/
    HW_CAN_IMASK1_WR(instance, 0x0);

    return (kStatus_FLEXCAN_Success);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_set_time_segments
 * Description   : Set FlexCAN time segments.
 * This function will set all FlexCAN time segments which define the length of
 * Propagation Segment in the bit time, the length of Phase Buffer Segment 2 in
 * the bit time, the length of Phase Buffer Segment 1 in the bit time, the ratio
 * between the PE clock frequency and the Serial Clock (Sclock) frequency, and
 * the maximum number of time quanta that a bit time can be changed by one
 * resynchronization. (One time quantum is equal to the Sclock period.)
 *
 *END**************************************************************************/
void flexcan_hal_set_time_segments(
    uint8_t instance,
    flexcan_time_segment_t *time_seg)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);

    /* Set Freeze mode*/
    HW_CAN_MCR_SET(instance, (BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT));

    /* Wait for entering the freeze mode*/
    while(!(BR_CAN_MCR_FRZACK(instance))) {}

    /* Set FlexCAN time segments*/
    HW_CAN_CTRL1_CLR(instance, (CAN_CTRL1_PROPSEG_MASK | CAN_CTRL1_PSEG2_MASK |
                                CAN_CTRL1_PSEG1_MASK | CAN_CTRL1_PRESDIV_MASK) |
                                CAN_CTRL1_RJW_MASK);
    HW_CAN_CTRL1_SET(instance, (CAN_CTRL1_PROPSEG(time_seg->propseg) |
                                CAN_CTRL1_PSEG2(time_seg->pseg2) |
                                CAN_CTRL1_PSEG1(time_seg->pseg1) |
                                CAN_CTRL1_PRESDIV(time_seg->pre_divider) |
                                CAN_CTRL1_RJW(time_seg->rjw)));

    /* De-assert Freeze mode*/
    HW_CAN_MCR_CLR(instance, (BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT));
    /* Wait till exit of freeze mode*/
    while(BR_CAN_MCR_FRZACK(instance)){}
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_get_time_segments
 * Description   : Get FlexCAN time segments.
 * This function will get all FlexCAN time segments defined.
 *
 *END**************************************************************************/
void flexcan_hal_get_time_segments(
    uint8_t instance,
    flexcan_time_segment_t *time_seg)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);

