maoravni/Dev/FEC/Common/3rdParty/umonm/umon_main/target/soc/kinetis/hal/can/fsl_flexcan_hal.c
        if (mb_idx <= (val2 - 1))
        {
            return (kStatus_FLEXCAN_InvalidArgument);
        }
    }

    /* Set the ID according the format structure*/
    if (cs->msg_id_type == kFlexCanMbId_Ext)
    {
        /* Set IDE*/
        flexcan_reg_ptr->MB[mb_idx].CS |= CAN_CS_IDE_MASK;

        /* Clear SRR bit*/
        flexcan_reg_ptr->MB[mb_idx].CS &= ~CAN_CS_SRR_MASK;

        /* Set the length of data in bytes*/
        flexcan_reg_ptr->MB[mb_idx].CS &= ~CAN_CS_DLC_MASK;
        flexcan_reg_ptr->MB[mb_idx].CS |= CAN_CS_DLC(cs->data_length);

        /* ID [28-0]*/
        flexcan_reg_ptr->MB[mb_idx].ID &= ~(CAN_ID_STD_MASK | CAN_ID_EXT_MASK);
        flexcan_reg_ptr->MB[mb_idx].ID |= (msg_id & (CAN_ID_STD_MASK | CAN_ID_EXT_MASK));

        /* Set MB CODE*/
        if (cs->code != kFlexCanRX_NotUsed)
        {
            flexcan_reg_ptr->MB[mb_idx].CS &= ~CAN_CS_CODE_MASK;
            flexcan_reg_ptr->MB[mb_idx].CS |= CAN_CS_CODE(cs->code);
        }
    }
    else if(cs->msg_id_type == kFlexCanMbId_Std)
    {
        /* Make sure IDE and SRR are not set*/
        flexcan_reg_ptr->MB[mb_idx].CS &= ~(CAN_CS_IDE_MASK | CAN_CS_SRR_MASK);

        /* Set the length of data in bytes*/
        flexcan_reg_ptr->MB[mb_idx].CS &= ~CAN_CS_DLC_MASK;
        flexcan_reg_ptr->MB[mb_idx].CS |= (cs->data_length) << CAN_CS_DLC_SHIFT;

        /* ID[28-18]*/
        flexcan_reg_ptr->MB[mb_idx].ID &= ~CAN_ID_STD_MASK;
        flexcan_reg_ptr->MB[mb_idx].ID |= CAN_ID_STD(msg_id);

        /* Set MB CODE*/
        if (cs->code != kFlexCanRX_NotUsed)
        {
            flexcan_reg_ptr->MB[mb_idx].CS &= ~CAN_CS_CODE_MASK;
            flexcan_reg_ptr->MB[mb_idx].CS |= CAN_CS_CODE(cs->code);
        }
    }
    else
    {
        return (kStatus_FLEXCAN_InvalidArgument);
    }

    return (kStatus_FLEXCAN_Success);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_get_mb
 * Description   : Get a message buffer field values.
 * This function will first check if RX FIFO is enabled. If RX FIFO is enabled,
 * the function will make sure if the MB requested is not occupied by RX FIFO
 * and ID filter table. Then this function will get the message buffer field
 * values and copy the MB data field into user's buffer.
 *
 *END**************************************************************************/
flexcan_status_t flexcan_hal_get_mb(
    uint8_t instance,
    const flexcan_user_config_t *data,
    uint32_t mb_idx,
    flexcan_mb_t *mb)
{
    uint32_t i;
    uint32_t val1, val2 = 1;
    volatile CAN_Type  *flexcan_reg_ptr;
    assert(instance < HW_CAN_INSTANCE_COUNT);
    assert(data);

    flexcan_reg_ptr = ((CAN_Type *)REGS_CAN_BASE(instance));
    if (NULL == flexcan_reg_ptr)
    {
        return (kStatus_FLEXCAN_InvalidArgument);
    }

    if (mb_idx >= data->max_num_mb)
    {
        return (kStatus_FLEXCAN_OutOfRange);
    }

    /* Check if RX FIFO is enabled*/
    if (BR_CAN_MCR_RFEN(instance))
    {
        /* Get the number of RX FIFO Filters*/
        val1 = BR_CAN_CTRL2_RFFN(instance);
        /* Get the number if MBs occupied by RX FIFO and ID filter table*/
        /* the Rx FIFO occupies the memory space originally reserved for MB0-5*/
        /* Every number of RFFN means 8 number of RX FIFO filters*/
        /* and every 4 number of RX FIFO filters occupied one MB*/
        val2 = 6 + (val1 + 1) * 8 / 4;

        if (mb_idx <= (val2 - 1))
        {
            return (kStatus_FLEXCAN_InvalidArgument);
        }
    }

    /* Get a MB field values*/
    mb->cs = flexcan_reg_ptr->MB[mb_idx].CS;
    if ((mb->cs) & CAN_CS_IDE_MASK)
    {
        mb->msg_id = flexcan_reg_ptr->MB[mb_idx].ID;
    }
    else
    {
        mb->msg_id = (flexcan_reg_ptr->MB[mb_idx].ID) >> CAN_ID_STD_SHIFT;
    }

    /* Copy MB data field into user's buffer*/
    for (i=0 ; i < kFlexCanMessageSize ; i++)
    {
        if (i < 4)
        {
            mb->data[3 - i] = ((flexcan_reg_ptr->MB[mb_idx].WORD0) >> (i * 8)) &
                              FLEXCAN_BYTE_DATA_FIELD_MASK;
        }
        else
        {
            mb->data[11 - i] = ((flexcan_reg_ptr->MB[mb_idx].WORD1) >> ((i - 4) * 8)) &
                               FLEXCAN_BYTE_DATA_FIELD_MASK;
        }
    }

    return (kStatus_FLEXCAN_Success);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_lock_rx_mb
 * Description   : Lock the RX message buffer.
 * This function will the RX message buffer.
 *
 *END**************************************************************************/
flexcan_status_t flexcan_hal_lock_rx_mb(
    uint8_t instance,
    const flexcan_user_config_t *data,
    uint32_t mb_idx)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);
    assert(data);

    volatile CAN_Type  *flexcan_reg_ptr;

    flexcan_reg_ptr = ((CAN_Type *)REGS_CAN_BASE(instance));
    if (NULL == flexcan_reg_ptr)
    {
        return (kStatus_FLEXCAN_InvalidArgument);
    }

    if (mb_idx >= data->max_num_mb)
    {
        return (kStatus_FLEXCAN_OutOfRange);
    }

    /* Lock the mailbox*/
    flexcan_reg_ptr->MB[mb_idx].CS;

    return (kStatus_FLEXCAN_Success);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_enable_rx_fifo
 * Description   : Enable Rx FIFO feature.
 * This function will enable the Rx FIFO feature.
 *
 *END**************************************************************************/
void flexcan_hal_enable_rx_fifo(uint8_t instance)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);

    /* Set Freeze mode*/
    HW_CAN_MCR_SET(instance, (BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT));

    /* Wait for entering the freeze mode*/
    while (!(BR_CAN_MCR_FRZACK(instance))){}

