maoravni/Dev/FEC/Common/3rdParty/umonm/umon_main/target/soc/kinetis/hal/can/fsl_flexcan_hal.c
    /* Enable RX FIFO*/
    HW_CAN_MCR_SET(instance, BM_CAN_MCR_RFEN);

    /* De-assert Freeze Mode*/
    HW_CAN_MCR_CLR(instance, (BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT));

    /* Wait till exit of freeze mode*/
    while (BR_CAN_MCR_FRZACK(instance)){}
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_disable_rx_fifo
 * Description   : Disable Rx FIFO feature.
 * This function will disable the Rx FIFO feature.
 *
 *END**************************************************************************/
void flexcan_hal_disable_rx_fifo(uint8_t instance)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);

    /* Set Freeze mode*/
    HW_CAN_MCR_SET(instance, (BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT));

    /* Wait for entering the freeze mode*/
    while(!(BR_CAN_MCR_FRZACK(instance))){}

    /* Disable RX FIFO*/
    HW_CAN_MCR_CLR(instance, BM_CAN_MCR_RFEN);

    /* De-assert Freeze Mode*/
    HW_CAN_MCR_CLR(instance, (BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT));

    /* Wait till exit of freeze mode*/
    while (BR_CAN_MCR_FRZACK(instance)){}
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_set_rx_fifo_filters_number
 * Description   : Set the number of Rx FIFO filters.
 * This function will define the number of Rx FIFO filters.
 *
 *END**************************************************************************/
void flexcan_hal_set_rx_fifo_filters_number(
    uint8_t instance,
    uint32_t number)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);

    /* Set Freeze mode*/
    HW_CAN_MCR_SET(instance, (BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT));

    /* Wait for entering the freeze mode*/
    while(!(BR_CAN_MCR_FRZACK(instance))){}

    /* Set the number of RX FIFO ID filters*/
    BW_CAN_CTRL2_RFFN(instance, number);

    /* De-assert Freeze Mode*/
    HW_CAN_MCR_CLR(instance, (BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT));

    /* Wait till exit of freeze mode*/
    while (BR_CAN_MCR_FRZACK(instance)){}
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_set_max_mb_number
 * Description   : Set the number of the last Message Buffers.
 * This function will define the number of the last Message Buffers
 *
*END**************************************************************************/
void flexcan_hal_set_max_mb_number(
    uint8_t instance,
    const flexcan_user_config_t *data)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);
    assert(data);

    /* Set Freeze mode*/
    HW_CAN_MCR_SET(instance, BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT);

    /* Wait for entering the freeze mode*/
    while(!(BR_CAN_MCR_FRZACK(instance))){}

    /* Set the maximum number of MBs*/
    BW_CAN_MCR_MAXMB(instance, data->max_num_mb);

    /* De-assert Freeze Mode*/
    HW_CAN_MCR_CLR(instance, (BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT));

    /* Wait till exit of freeze mode*/
    while (BR_CAN_MCR_FRZACK(instance)){}
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_set_id_filter_table_elements
 * Description   : Set ID filter table elements.
 * This function will set up ID filter table elements.
 *
 *END**************************************************************************/
flexcan_status_t flexcan_hal_set_id_filter_table_elements(
    uint8_t instance,
    const flexcan_user_config_t *data,
    flexcan_rx_fifo_id_element_format_t id_format,
    flexcan_id_table_t *id_filter_table)
{
    uint32_t i, j;
    uint32_t val1, val2, val;
    volatile CAN_Type  *flexcan_reg_ptr;

    assert(instance < HW_CAN_INSTANCE_COUNT);
    assert(data);

    flexcan_reg_ptr = ((CAN_Type *)REGS_CAN_BASE(instance));
    if (NULL == flexcan_reg_ptr)
    {
        return (kStatus_FLEXCAN_InvalidArgument);
    }

   switch(id_format)
    {
    case (kFlexCanRxFifoIdElementFormat_A):
        /* One full ID (standard and extended) per ID Filter Table element.*/
        BW_CAN_MCR_IDAM(instance, kFlexCanRxFifoIdElementFormat_A);
        if (id_filter_table->is_remote_mb)
        {
            val = 1U << 31U;
        }
        if (id_filter_table->is_extended_mb)
        {
            val |= 1 << 30;
            j = 0;
            for (i = 0; i < (data->num_id_filters + 1) * 8; i += 4)
            {
                flexcan_reg_ptr->MB[6 + i - j * 3].CS =
                val + ((*(id_filter_table->id_filter + i)) <<
                        FLEXCAN_RX_FIFO_ID_FILTER_FORMATA_EXT_SHIFT &
                        FLEXCAN_RX_FIFO_ID_FILTER_FORMATA_EXT_MASK);
                flexcan_reg_ptr->MB[6 + i - j * 3].ID =
                val + ((*(id_filter_table->id_filter + i + 1)) <<
                        FLEXCAN_RX_FIFO_ID_FILTER_FORMATA_EXT_SHIFT &
                        FLEXCAN_RX_FIFO_ID_FILTER_FORMATA_EXT_MASK);
                flexcan_reg_ptr->MB[6 + i - j * 3].WORD0 =
                val + ((*(id_filter_table->id_filter + i + 2)) <<
                        FLEXCAN_RX_FIFO_ID_FILTER_FORMATA_EXT_SHIFT &
                        FLEXCAN_RX_FIFO_ID_FILTER_FORMATA_EXT_MASK);
                flexcan_reg_ptr->MB[6 + i - j * 3].WORD1 =
                val + ((*(id_filter_table->id_filter + i + 3)) <<
                        FLEXCAN_RX_FIFO_ID_FILTER_FORMATA_EXT_SHIFT &
                        FLEXCAN_RX_FIFO_ID_FILTER_FORMATA_EXT_MASK);
                j++;
            }
        }
        else
        {
            j = 0;
            for (i = 0; i < (data->num_id_filters + 1) * 8; i += 4)
            {
                flexcan_reg_ptr->MB[6 + i - j * 3].CS =
                val + ((*(id_filter_table->id_filter + i)) <<
                        FLEXCAN_RX_FIFO_ID_FILTER_FORMATA_STD_SHIFT &
                        FLEXCAN_RX_FIFO_ID_FILTER_FORMATA_STD_MASK);
                flexcan_reg_ptr->MB[6 + i - j * 3].ID =
                val + ((*(id_filter_table->id_filter + i + 1)) <<
                        FLEXCAN_RX_FIFO_ID_FILTER_FORMATA_STD_SHIFT &
                        FLEXCAN_RX_FIFO_ID_FILTER_FORMATA_STD_MASK);
                flexcan_reg_ptr->MB[6 + i - j * 3].WORD0 =
                val + ((*(id_filter_table->id_filter + i + 2)) <<
                        FLEXCAN_RX_FIFO_ID_FILTER_FORMATA_STD_SHIFT &
                        FLEXCAN_RX_FIFO_ID_FILTER_FORMATA_STD_MASK);
                flexcan_reg_ptr->MB[6 + i - j * 3].WORD1 =
                val + ((*(id_filter_table->id_filter + i + 3)) <<
                        FLEXCAN_RX_FIFO_ID_FILTER_FORMATA_STD_SHIFT &
                        FLEXCAN_RX_FIFO_ID_FILTER_FORMATA_STD_MASK);
                j++;
            }
        }
        break;
    case (kFlexCanRxFifoIdElementFormat_B):
        /* Two full standard IDs or two partial 14-bit (standard and extended) IDs*/
        /* per ID Filter Table element.*/
        BW_CAN_MCR_IDAM(instance, kFlexCanRxFifoIdElementFormat_B);
        if (id_filter_table->is_remote_mb)
        {
            val1 = 1U << 31U;
            val2 = 1 << 15;
        }
        if (id_filter_table->is_extended_mb)
        {
            val1 |= 1 << 30;
            val2 |= 1 << 14;
            j = 0;
            for (i = 0; i < (data->num_id_filters + 1) * 8; i += 8)
            {
                flexcan_reg_ptr->MB[6 + i - j * 3].CS =
                val1 + ((*(id_filter_table->id_filter + i)) &
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_EXT_MASK <<
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_EXT_SHIFT1);
                flexcan_reg_ptr->MB[6 + i - j * 3].CS |=
                val2 + ((*(id_filter_table->id_filter + i + 1)) &
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_EXT_MASK <<
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_EXT_SHIFT2);

                flexcan_reg_ptr->MB[6 + i - j * 3].ID =
                val1 + ((*(id_filter_table->id_filter + i + 2)) &
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_EXT_MASK <<
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_EXT_SHIFT1);
                flexcan_reg_ptr->MB[6 + i - j * 3].ID |=
                val2 + ((*(id_filter_table->id_filter + i + 3)) &
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_EXT_MASK <<
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_EXT_SHIFT2);

                flexcan_reg_ptr->MB[6 + i - j * 3].WORD0 =
                val1 + ((*(id_filter_table->id_filter + i + 4)) &
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_EXT_MASK <<
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_EXT_SHIFT1);
                flexcan_reg_ptr->MB[6 + i - j * 3].WORD0 |=
                val2 + ((*(id_filter_table->id_filter + i + 5)) &
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_EXT_MASK <<
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_EXT_SHIFT2);

