maoravni/Dev/FEC/Common/3rdParty/umonm/umon_main/target/soc/kinetis/hal/can/fsl_flexcan_hal.c
                flexcan_reg_ptr->MB[6 + i - j * 3].WORD1 =
                val1 + ((*(id_filter_table->id_filter + i + 6)) &
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_EXT_MASK <<
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_EXT_SHIFT1);
                flexcan_reg_ptr->MB[6 + i - j * 3].WORD1 |=
                val2 + ((*(id_filter_table->id_filter + i + 7)) &
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_EXT_MASK <<
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_EXT_SHIFT2);
                j++;
            }
        }
        else
        {
            j = 0;
            for (i = 0; i < (data->num_id_filters + 1) * 8; i += 8)
            {
                flexcan_reg_ptr->MB[6 + i - j * 3].CS =
                val1 + (((*(id_filter_table->id_filter + i)) &
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_STD_MASK) <<
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_STD_SHIFT1);
                flexcan_reg_ptr->MB[6 + i - j * 3].CS |=
                val2 + (((*(id_filter_table->id_filter + i + 1)) &
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_STD_MASK) <<
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_STD_SHIFT2);

                flexcan_reg_ptr->MB[6 + i - j * 3].ID =
                val1 + (((*(id_filter_table->id_filter + i + 2)) &
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_STD_MASK) <<
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_STD_SHIFT1);
                flexcan_reg_ptr->MB[6 + i - j * 3].ID |=
                val2 + (((*(id_filter_table->id_filter + i + 3)) &
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_STD_MASK) <<
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_STD_SHIFT2);

                flexcan_reg_ptr->MB[6 + i - j * 3].WORD0 =
                val1 + (((*(id_filter_table->id_filter + i + 4)) &
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_STD_MASK) <<
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_STD_SHIFT1);
                flexcan_reg_ptr->MB[6 + i - j * 3].WORD0 |=
                val2 + (((*(id_filter_table->id_filter + i + 5)) &
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_STD_MASK) <<
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_STD_SHIFT2);

                flexcan_reg_ptr->MB[6 + i - j * 3].WORD1 =
                val1 + (((*(id_filter_table->id_filter + i + 6)) &
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_STD_MASK) <<
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_STD_SHIFT1);
                flexcan_reg_ptr->MB[6 + i - j * 3].WORD1 |=
                val2 + (((*(id_filter_table->id_filter + i + 7)) &
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_STD_MASK) <<
                         FLEXCAN_RX_FIFO_ID_FILTER_FORMATB_STD_SHIFT2);
                j++;
            }
        }
      break;
    case (kFlexCanRxFifoIdElementFormat_C):
        /* Four partial 8-bit Standard IDs per ID Filter Table element.*/
        BW_CAN_MCR_IDAM(instance, kFlexCanRxFifoIdElementFormat_C);
        j = 0;
        for (i = 0; i < (data->num_id_filters + 1) * 8; i += 16)
        {
            flexcan_reg_ptr->MB[6 + i - j * 3].CS =
            ((*(id_filter_table->id_filter + i)) & FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_MASK <<
             FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_SHIFT1);
            flexcan_reg_ptr->MB[6 + i - j * 3].CS |=
            ((*(id_filter_table->id_filter + i + 1)) & FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_MASK <<
             FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_SHIFT2);
            flexcan_reg_ptr->MB[6 + i - j * 3].CS |=
            ((*(id_filter_table->id_filter + i + 2)) & FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_MASK <<
             FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_SHIFT3);
            flexcan_reg_ptr->MB[6 + i - j * 3].CS |=
            ((*(id_filter_table->id_filter + i + 3)) & FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_MASK <<
             FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_SHIFT4);

            flexcan_reg_ptr->MB[6 + i - j * 3].ID =
            ((*(id_filter_table->id_filter + i + 4)) & FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_MASK <<
             FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_SHIFT1);
            flexcan_reg_ptr->MB[6 + i - j * 3].ID |=
            ((*(id_filter_table->id_filter + i + 5)) & FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_MASK <<
             FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_SHIFT2);
            flexcan_reg_ptr->MB[6 + i - j * 3].ID |=
            ((*(id_filter_table->id_filter + i + 6)) & FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_MASK <<
             FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_SHIFT3);
            flexcan_reg_ptr->MB[6 + i - j * 3].ID |=
            ((*(id_filter_table->id_filter + i + 7)) & FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_MASK <<
             FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_SHIFT4);

            flexcan_reg_ptr->MB[6 + i - j * 3].WORD0 =
            ((*(id_filter_table->id_filter + i + 8)) & FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_MASK <<
             FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_SHIFT1);
            flexcan_reg_ptr->MB[6 + i - j * 3].WORD0 |=
            ((*(id_filter_table->id_filter + i + 9)) & FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_MASK <<
             FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_SHIFT2);
            flexcan_reg_ptr->MB[6 + i - j * 3].WORD0 |=
            ((*(id_filter_table->id_filter + i + 10)) & FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_MASK <<
             FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_SHIFT3);
            flexcan_reg_ptr->MB[6 + i - j * 3].WORD0 |=
            ((*(id_filter_table->id_filter + i + 11)) & FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_MASK <<
             FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_SHIFT4);

            flexcan_reg_ptr->MB[6 + i - j * 3].WORD1 =
            ((*(id_filter_table->id_filter + i + 12)) & FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_MASK <<
             FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_SHIFT1);
            flexcan_reg_ptr->MB[6 + i - j * 3].WORD1 |=
            ((*(id_filter_table->id_filter + i + 13)) & FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_MASK <<
             FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_SHIFT2);
            flexcan_reg_ptr->MB[6 + i - j * 3].WORD1 |=
            ((*(id_filter_table->id_filter + i + 14)) & FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_MASK <<
             FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_SHIFT3);
            flexcan_reg_ptr->MB[6 + i - j * 3].WORD1 |=
            ((*(id_filter_table->id_filter + i + 15)) & FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_MASK <<
             FLEXCAN_RX_FIFO_ID_FILTER_FORMATC_SHIFT4);

            j++;
        }
        break;
    case (kFlexCanRxFifoIdElementFormat_D):
        /* All frames rejected.*/
        BW_CAN_MCR_IDAM(instance, kFlexCanRxFifoIdElementFormat_D);
        break;
    default:
        return kStatus_FLEXCAN_InvalidArgument;
   }

   return (kStatus_FLEXCAN_Success);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_set_rx_fifo
 * Description   : Confgure RX FIFO ID filter table elements.
 *
 *END**************************************************************************/
flexcan_status_t flexcan_hal_set_rx_fifo(
    uint8_t instance,
    const flexcan_user_config_t *data,
    flexcan_rx_fifo_id_element_format_t id_format,
    flexcan_id_table_t *id_filter_table)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);
    assert(data);

