maoravni/Dev/FEC/Common/3rdParty/umonm/umon_main/target/soc/kinetis/hal/can/fsl_flexcan_hal.c
    if (!data->is_rx_fifo_needed)
    {
        return (kStatus_FLEXCAN_InvalidArgument);
    }

    if (data->num_mb > data->max_num_mb)
    {
        return (kStatus_FLEXCAN_OutOfRange);
    }

    /* Set RX FIFO ID filter table elements*/
    return flexcan_hal_set_id_filter_table_elements(instance, data, id_format, id_filter_table);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_enable_mb_interrupt
 * Description   : Enable the corresponding Message Buffer interrupt.
 *
 *END**************************************************************************/
flexcan_status_t flexcan_hal_enable_mb_interrupt(
    uint8_t instance,
    const flexcan_user_config_t *data,
    uint32_t mb_idx)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);
    assert(data);
    uint32_t temp;

    if ( mb_idx >= data->max_num_mb)
    {
        return (kStatus_FLEXCAN_OutOfRange);
    }

    /* Enable the corresponding message buffer Interrupt*/
    temp = 0x1 << mb_idx;
    HW_CAN_IMASK1_SET(instance, temp);

    return (kStatus_FLEXCAN_Success);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_disable_mb_interrupt
 * Description   : Disable the corresponding Message Buffer interrupt.
 *
 *END**************************************************************************/
flexcan_status_t flexcan_hal_disable_mb_interrupt(
    uint8_t instance,
    const flexcan_user_config_t *data,
    uint32_t mb_idx)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);
    assert(data);
    uint32_t temp;

    if (mb_idx >= data->max_num_mb)
    {
        return (kStatus_FLEXCAN_OutOfRange);
    }

    /* Disable the corresponding message buffer Interrupt*/
    temp = 0x1 << mb_idx;
    HW_CAN_IMASK1_CLR(instance, temp);

    return (kStatus_FLEXCAN_Success);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_enable_error_interrupt
 * Description   : Enable the error interrupts.
 * This function will enable Error interrupt.
 *
 *END**************************************************************************/
void flexcan_hal_enable_error_interrupt(uint8_t instance)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);

    /* Enable Error interrupt*/
    HW_CAN_CTRL1_SET(instance, CAN_CTRL1_ERRMSK_MASK);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_disable_error_interrupt
 * Description   : Disable the error interrupts.
 * This function will disable Error interrupt.
 *
 *END**************************************************************************/
void flexcan_hal_disable_error_interrupt(uint8_t instance)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);

    /* Disable Error interrupt*/
    HW_CAN_CTRL1_CLR(instance, CAN_CTRL1_ERRMSK_MASK);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_enable_bus_off_interrupt
 * Description   : Enable the Bus off interrupts.
 * This function will enable Bus Off interrupt.
 *
 *END**************************************************************************/
void flexcan_hal_enable_bus_off_interrupt(uint8_t instance)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);

    /* Enable Bus Off interrupt*/
    HW_CAN_CTRL1_SET(instance, CAN_CTRL1_BOFFMSK_MASK);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_disable_bus_off_interrupt
 * Description   : Disable the Bus off interrupts.
 * This function will disable Bus Off interrupt.
 *
 *END**************************************************************************/
void flexcan_hal_disable_bus_off_interrupt(uint8_t instance)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);

    /* Disable Bus Off interrupt*/
    HW_CAN_CTRL1_CLR(instance, CAN_CTRL1_BOFFMSK_MASK);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_enable_wakeup_interrupt
 * Description   : Enable the wakeup interrupts.
 * This function will enable Wake up interrupt.
 *
 *END**************************************************************************/
void flexcan_hal_enable_wakeup_interrupt(uint8_t instance)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);

    /* Enable Wake Up interrupt*/
    BW_CAN_MCR_WAKMSK(instance, 1);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_disable_wakeup_interrupt
 * Description   : Disable the wakeup interrupts.
 * This function will disable Wake up interrupt.
 *
 *END**************************************************************************/
void flexcan_hal_disable_wakeup_interrupt(uint8_t instance)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);

    /* Disable Wake Up interrupt*/
    BW_CAN_MCR_WAKMSK(instance, 0);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_enable_tx_warning_interrupt
 * Description   : Enable the TX warning interrupts.
 * This function will enable TX warning interrupt.
 *
 *END**************************************************************************/
void flexcan_hal_enable_tx_warning_interrupt(uint8_t instance)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);

    /* Enable TX warning interrupt*/
    HW_CAN_CTRL1_SET(instance, CAN_CTRL1_TWRNMSK_MASK);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_disable_tx_warning_interrupt
 * Description   : Disable the TX warning interrupts.
 * This function will disable TX warning interrupt.
 *
 *END**************************************************************************/
void flexcan_hal_disable_tx_warning_interrupt(uint8_t instance)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);

