maoravni/Dev/FEC/Common/3rdParty/umonm/umon_main/target/soc/kinetis/hal/can/fsl_flexcan_hal.c
    /* Disable TX warning interrupt*/
    HW_CAN_CTRL1_CLR(instance, CAN_CTRL1_TWRNMSK_MASK);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_enable_rx_warning_interrupt
 * Description   : Enable the RX warning interrupts.
 * This function will enable RX warning interrupt.
 *
 *END**************************************************************************/
void flexcan_hal_enable_rx_warning_interrupt(uint8_t instance)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);

    /* Enable RX warning interrupt*/
    HW_CAN_CTRL1_SET(instance, CAN_CTRL1_RWRNMSK_MASK);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_disable_rx_warning_interrupt
 * Description   : Disable the RX warning interrupts.
 * This function will disable RX warning interrupt.
 *
 *END**************************************************************************/
void flexcan_hal_disable_rx_warning_interrupt(uint8_t instance)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);

    /* Disable RX warning interrupt*/
    HW_CAN_CTRL1_CLR(instance, CAN_CTRL1_RWRNMSK_MASK);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_exit_freeze_mode
 * Description   : Exit of freeze mode.
 *
 *END**************************************************************************/
void flexcan_hal_exit_freeze_mode(uint8_t instance)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);
    HW_CAN_MCR_CLR(instance, (BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT));

    /* Wait till exit freeze mode*/
    while (BR_CAN_MCR_FRZACK(instance)){}
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_enter_freeze_mode
 * Description   : Enter the freeze mode.
 *
 *END**************************************************************************/
void flexcan_hal_enter_freeze_mode(uint8_t instance)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);
    HW_CAN_MCR_SET(instance, (BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT));

    /* Wait for entering the freeze mode*/
    while (!(BR_CAN_MCR_FRZACK(instance))){}
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_get_mb_int_flag
 * Description   : Get the corresponding message buffer interrupt flag.
 *
 *END**************************************************************************/
uint8_t flexcan_hal_get_mb_int_flag(
    uint8_t instance,
    const flexcan_user_config_t *data,
    uint32_t mb_idx)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);
    assert(data);
    assert(mb_idx < data->max_num_mb);
    uint32_t temp;

    /* Get the corresponding message buffer interrupt flag*/
    temp = 0x1 << mb_idx;
    if (HW_CAN_IFLAG1_RD(instance) & temp)
    {
        return 1;
    }
    else
    {
        return 0;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_get_err_counter
 * Description   : Get transmit error counter and receive error counter.
 *
 *END**************************************************************************/
void flexcan_hal_get_err_counter(
    uint8_t instance,
    flexcan_berr_counter_t *err_cnt)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);

    /* Get transmit error counter and receive error counter*/
    err_cnt->rxerr = HW_CAN_ECR(instance).B.RXERRCNT;
    err_cnt->txerr = HW_CAN_ECR(instance).B.TXERRCNT;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_clear_err_interrupt_status
 * Description   : Clear all error interrupt status.
 *
 *END**************************************************************************/
void flexcan_hal_clear_err_interrupt_status(uint8_t instance)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);

    if(HW_CAN_IFLAG1_RD(instance) & FLEXCAN_ALL_INT)
    {
        HW_CAN_ESR1_SET(instance, FLEXCAN_ALL_INT);
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_read_fifo
 * Description   : Read Rx FIFO data.
 * This function will copy MB[0] data field into user's buffer.
 *
 *END**************************************************************************/
flexcan_status_t flexcan_hal_read_fifo(
    uint8_t instance,
    flexcan_mb_t *rx_fifo)
{
    uint32_t i;
    volatile CAN_Type  *flexcan_reg_ptr;
    assert(instance < HW_CAN_INSTANCE_COUNT);

    flexcan_reg_ptr = ((CAN_Type *)REGS_CAN_BASE(instance));
    if (NULL == flexcan_reg_ptr)
    {
        return (kStatus_FLEXCAN_InvalidArgument);
    }

    rx_fifo->cs = flexcan_reg_ptr->MB[0].CS;

    if ((rx_fifo->cs) & CAN_CS_IDE_MASK)
    {
        rx_fifo->msg_id = flexcan_reg_ptr->MB[0].ID;
    }
    else
    {
        rx_fifo->msg_id = (flexcan_reg_ptr->MB[0].ID) >> CAN_ID_STD_SHIFT;
    }

    /* Copy MB[0] data field into user's buffer*/
    for ( i=0 ; i < kFlexCanMessageSize ; i++ )
    {
        if (i < 4)
        {
            rx_fifo->data[3 - i] = ((flexcan_reg_ptr->MB[0].WORD0) >> (i * 8)) &
                                   FLEXCAN_BYTE_DATA_FIELD_MASK;
        }
        else
        {
            rx_fifo->data[11 - i] = ((flexcan_reg_ptr->MB[0].WORD1) >> ((i - 4) * 8)) &
                                    FLEXCAN_BYTE_DATA_FIELD_MASK;
        }
    }
    
    return (kStatus_FLEXCAN_Success);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_set_mask_type
 * Description   : Set RX masking type.
 * This function will set RX masking type as RX global mask or RX individual
 * mask.
 *
 *END**************************************************************************/
void flexcan_hal_set_mask_type(
    uint8_t instance,
    flexcan_rx_mask_type_t type)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);

    /* Set Freeze mode*/
    HW_CAN_MCR_SET(instance, BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT);

    /* Wait for entering the freeze mode*/
    while (!(BR_CAN_MCR_FRZACK(instance))){}

    /* Set RX masking type (RX global mask or RX individual mask)*/
    if (type == kFlexCanRxMask_Global)
    {
        /* Enable Global RX masking*/
        HW_CAN_MCR_CLR(instance, BM_CAN_MCR_IRMQ);
    }
    else
    {
        /* Enable Individual Rx Masking and Queue*/
        HW_CAN_MCR_SET(instance, BM_CAN_MCR_IRMQ);
    }

    /* De-assert Freeze Mode*/
    HW_CAN_MCR_CLR(instance, (BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT));

