maoravni/Dev/FEC/Common/3rdParty/umonm/umon_main/target/soc/kinetis/hal/can/fsl_flexcan_hal.c
    /* Wait till exit of freeze mode*/
    while (BR_CAN_MCR_FRZACK(instance)){}
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_set_rx_fifo_global_std_mask
 * Description   : Set Rx FIFO global mask as the 11-bit standard mask.
 *
 *END**************************************************************************/
void flexcan_hal_set_rx_fifo_global_std_mask(
    uint8_t instance,
    uint32_t std_mask)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);

    /* Set Freeze mode*/
    HW_CAN_MCR_SET(instance, BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT);

    /* Wait for entering the freeze mode*/
    while (!(BR_CAN_MCR_FRZACK(instance))){}

    /* 11 bit standard mask*/
    HW_CAN_RXFGMASK_WR(instance, CAN_ID_STD(std_mask));

    /* De-assert Freeze Mode*/
    HW_CAN_MCR_CLR(instance, (BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT));

    /* Wait till exit of freeze mode*/
    while (BR_CAN_MCR_FRZACK(instance)){}
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_set_rx_fifo_global_ext_mask
 * Description   : Set Rx FIFO global mask as the 29-bit extended mask.
 *
 *END**************************************************************************/
void flexcan_hal_set_rx_fifo_global_ext_mask(
    uint8_t instance,
    uint32_t ext_mask)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);

    /* Set Freeze mode*/
    HW_CAN_MCR_SET(instance, BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT);

    /* Wait for entering the freeze mode*/
    while (!(BR_CAN_MCR_FRZACK(instance))){}

    /* 29-bit extended mask*/
    HW_CAN_RXFGMASK_WR(instance, CAN_ID_EXT(ext_mask));

    /* De-assert Freeze Mode*/
    HW_CAN_MCR_CLR(instance, (BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT));

    /* Wait till exit of freeze mode*/
    while (BR_CAN_MCR_FRZACK(instance)){}
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_set_rx_individual_std_mask
 * Description   : Set Rx individual mask as the 11-bit standard mask.
 *
 *END**************************************************************************/
flexcan_status_t flexcan_hal_set_rx_individual_std_mask(
    uint8_t instance,
    const flexcan_user_config_t * data,
    uint32_t mb_idx,
    uint32_t std_mask)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);
    assert(data);

    if (mb_idx >= data->max_num_mb)
    {
        return (kStatus_FLEXCAN_OutOfRange);
    }

    /* Set Freeze mode*/
    HW_CAN_MCR_SET(instance, BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT);

    /* Wait for entering the freeze mode*/
    while (!(BR_CAN_MCR_FRZACK(instance))){}

    /* 11 bit standard mask*/
    HW_CAN_RXIMRn_WR(instance, mb_idx, CAN_ID_STD(std_mask));

    /* De-assert Freeze Mode*/
    HW_CAN_MCR_CLR(instance, (BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT));

    /* Wait till exit of freeze mode*/
    while (BR_CAN_MCR_FRZACK(instance)){}

    return (kStatus_FLEXCAN_Success);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_set_rx_individual_ext_mask
 * Description   : Set Rx individual mask as the 29-bit extended mask.
 *
 *END**************************************************************************/
flexcan_status_t flexcan_hal_set_rx_individual_ext_mask(
    uint8_t instance,
    const flexcan_user_config_t * data,
    uint32_t mb_idx,
    uint32_t ext_mask)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);
    assert(data);

    if (mb_idx >= data->max_num_mb)
    {
        return (kStatus_FLEXCAN_OutOfRange);
    }

    /* Set Freeze mode*/
    HW_CAN_MCR_SET(instance, BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT);

    /* Wait for entering the freeze mode*/
    while (!(BR_CAN_MCR_FRZACK(instance))){}

    /* 29-bit extended mask*/
    HW_CAN_RXIMRn_WR(instance, mb_idx, CAN_ID_EXT(ext_mask));

    /* De-assert Freeze Mode*/
    HW_CAN_MCR_CLR(instance, (BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT));

    /* Wait till exit of freeze mode*/
    while (BR_CAN_MCR_FRZACK(instance)){}

    return (kStatus_FLEXCAN_Success);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_set_rx_mb_global_std_mask
 * Description   : Set Rx Message Buffer global mask as the 11-bit standard mask.
 *
 *END**************************************************************************/
void flexcan_hal_set_rx_mb_global_std_mask(
    uint8_t instance,
    uint32_t std_mask)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);

    /* Set Freeze mode*/
    HW_CAN_MCR_SET(instance, BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT);

    /* Wait for entering the freeze mode*/
    while (!(BR_CAN_MCR_FRZACK(instance))){}

    /* 11 bit standard mask*/
    HW_CAN_RXMGMASK_WR(instance, CAN_ID_STD(std_mask));

    /* De-assert Freeze Mode*/
    HW_CAN_MCR_CLR(instance, (BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT));

    /* Wait till exit of freeze mode*/
    while (BR_CAN_MCR_FRZACK(instance)){}
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_set_rx_mb_buf14_std_mask
 * Description   : Set Rx Message Buffer 14 mask as the 11-bit standard mask.
 *
 *END**************************************************************************/
void flexcan_hal_set_rx_mb_buf14_std_mask(
    uint8_t instance,
    uint32_t std_mask)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);

    /* Set Freeze mode*/
    HW_CAN_MCR_SET(instance, BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT);

    /* Wait for entering the freeze mode*/
    while (!(BR_CAN_MCR_FRZACK(instance))){}

    /* 11 bit standard mask*/
    HW_CAN_RX14MASK_WR(instance, CAN_ID_STD(std_mask));

    /* De-assert Freeze Mode*/
    HW_CAN_MCR_CLR(instance, (BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT));

    /* Wait till exit of freeze mode*/
    while (BR_CAN_MCR_FRZACK(instance)){}
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_set_rx_mb_buf15_std_mask
 * Description   : Set Rx Message Buffer 15 mask as the 11-bit standard mask.
 *
 *END**************************************************************************/
void flexcan_hal_set_rx_mb_buf15_std_mask(
    uint8_t instance,
    uint32_t std_mask)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);

    /* Set Freeze mode*/
    HW_CAN_MCR_SET(instance, BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT);

    /* Wait for entering the freeze mode*/
    while (!(BR_CAN_MCR_FRZACK(instance))){}

    /* 11 bit standard mask*/
    HW_CAN_RX15MASK_WR(instance, CAN_ID_STD(std_mask));

    /* De-assert Freeze Mode*/
    HW_CAN_MCR_CLR(instance, (BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT));

