maoravni/Dev/FEC/Common/3rdParty/umonm/umon_main/target/soc/kinetis/hal/can/fsl_flexcan_hal.c
    /* Wait till exit of freeze mode*/
    while (BR_CAN_MCR_FRZACK(instance)){}
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_set_rx_mb_global_ext_mask
 * Description   : Set Rx Message Buffer global mask as the 29-bit extended mask.
 *
 *END**************************************************************************/
void flexcan_hal_set_rx_mb_global_ext_mask(
    uint8_t instance,
    uint32_t ext_mask)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);

    /* Set Freeze mode*/
    HW_CAN_MCR_SET(instance, BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT);

    /* Wait for entering the freeze mode*/
    while (!(HW_CAN_MCR_RD(instance))){}

    /* 29-bit extended mask*/
    HW_CAN_RXMGMASK_WR(instance, CAN_ID_EXT(ext_mask));

    /* De-assert Freeze Mode*/
    HW_CAN_MCR_CLR(instance, (BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT));

    /* Wait till exit of freeze mode*/
    while (BR_CAN_MCR_FRZACK(instance)){}
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_set_rx_mb_buf14_ext_mask
 * Description   : Set Rx Message Buffer 14 mask as the 29-bit extended mask.
 *
 *END**************************************************************************/
void flexcan_hal_set_rx_mb_buf14_ext_mask(
    uint8_t instance,
    uint32_t ext_mask)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);

    /* Set Freeze mode*/
    HW_CAN_MCR_SET(instance, BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT);

    /* Wait for entering the freeze mode*/
    while (!(BR_CAN_MCR_FRZACK(instance))){}

    /* 29-bit extended mask*/
    HW_CAN_RX14MASK_WR(instance, CAN_ID_EXT(ext_mask));

    /* De-assert Freeze Mode*/
    HW_CAN_MCR_CLR(instance, (BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT));

    /* Wait till exit of freeze mode*/
    while (BR_CAN_MCR_FRZACK(instance)){}
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_set_rx_mb_buf15_ext_mask
 * Description   : Set Rx Message Buffer 15 mask as the 29-bit extended mask.
 *
 *END**************************************************************************/
void flexcan_hal_set_rx_mb_buf15_ext_mask(
    uint8_t instance,
    uint32_t ext_mask)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);

    /* Set Freeze mode*/
    HW_CAN_MCR_SET(instance, BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT);

    /* Wait for entering the freeze mode*/
    while (!(BR_CAN_MCR_FRZACK(instance))){}

    /* 29-bit extended mask*/
    HW_CAN_RX15MASK_WR(instance, CAN_ID_EXT(ext_mask));

    /* De-assert Freeze Mode*/
    HW_CAN_MCR_CLR(instance, (BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT));

    /* Wait till exit of freeze mode*/
    while (BR_CAN_MCR_FRZACK(instance)){}
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_enable_operation_mode
 * Description   : Enable a FlexCAN operation mode.
 * This function will enable one of the modes listed in flexcan_operation_modes_t.
 *
 *END**************************************************************************/
flexcan_status_t flexcan_hal_enable_operation_mode(
    uint8_t instance,
    flexcan_operation_modes_t mode)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);

    if (mode == kFlexCanFreezeMode)
    {
        /* Debug mode, Halt and Freeze*/
        HW_CAN_MCR_SET(instance, (BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT));

        /* Wait for entering the freeze mode*/
        while (!(BR_CAN_MCR_FRZACK(instance))){}

        return (kStatus_FLEXCAN_Success);
    }
    else if (mode == kFlexCanDisableMode)
    {
        /* Debug mode, Halt and Freeze*/
        HW_CAN_MCR_SET(instance, BM_CAN_MCR_MDIS);
        return (kStatus_FLEXCAN_Success);
    }

    /* Set Freeze mode*/
    HW_CAN_MCR_SET(instance, BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT);

    /* Wait for entering the freeze mode*/
    while (!(BR_CAN_MCR_FRZACK(instance))){}

    if (mode == kFlexCanNormalMode)
    {
        HW_CAN_MCR_CLR(instance, BM_CAN_MCR_SUPV);
    }
    else if (mode == kFlexCanListenOnlyMode)
    {
        HW_CAN_CTRL1_SET(instance, BM_CAN_CTRL1_LOM);
    }
    else if (mode == kFlexCanLoopBackMode)
    {
        HW_CAN_CTRL1_SET(instance, BM_CAN_CTRL1_LPB);
    }
    else
    {
        return kStatus_FLEXCAN_InvalidArgument;
    }

    /* De-assert Freeze Mode*/
    HW_CAN_MCR_CLR(instance, (BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT));

    /* Wait till exit of freeze mode*/
    while (BR_CAN_MCR_FRZACK(instance)){}

    return (kStatus_FLEXCAN_Success);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : flexcan_hal_disable_operation_mode
 * Description   : Disable a FlexCAN operation mode.
 * This function will disable one of the modes listed in flexcan_operation_modes_t.
 *
 *END**************************************************************************/
flexcan_status_t flexcan_hal_disable_operation_mode(
    uint8_t instance,
    flexcan_operation_modes_t mode)
{
    assert(instance < HW_CAN_INSTANCE_COUNT);

    if (mode == kFlexCanFreezeMode)
    {
        /* De-assert Freeze Mode*/
        HW_CAN_MCR_CLR(instance, BM_CAN_MCR_FRZ);

        /* Wait till exit of freeze mode*/
        while (BR_CAN_MCR_FRZACK(instance)){}

        return (kStatus_FLEXCAN_Success);
    }
    else if (mode == kFlexCanDisableMode)
    {
        /* Enable module mode*/
        HW_CAN_MCR_CLR(instance, BM_CAN_MCR_MDIS);
        return (kStatus_FLEXCAN_Success);
    }

    /* Set Freeze mode*/
    HW_CAN_MCR_SET(instance, BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT);

    /* Wait for entering the freeze mode*/
    while (!(BR_CAN_MCR_FRZACK(instance))){}

    if (mode == kFlexCanNormalMode)
    {
        HW_CAN_MCR_SET(instance, BM_CAN_MCR_SUPV);
    }
    else if (mode == kFlexCanListenOnlyMode)
    {
        HW_CAN_CTRL1_CLR(instance, BM_CAN_CTRL1_LOM);
    }
    else if (mode == kFlexCanLoopBackMode)
    {
        HW_CAN_CTRL1_CLR(instance, BM_CAN_CTRL1_LPB);
    }
    else
    {
        return kStatus_FLEXCAN_InvalidArgument;
    }

    /* De-assert Freeze Mode*/
    HW_CAN_MCR_CLR(instance, (BM_CAN_MCR_FRZ | BM_CAN_MCR_HALT));

    /* Wait till exit of freeze mode*/
    while (BR_CAN_MCR_FRZACK(instance)){}

    return (kStatus_FLEXCAN_Success);
}

/*******************************************************************************
 * EOF
 ******************************************************************************/

